namespace Oshima.FunGame.OshimaModules.Items
{
    public enum AccessoryID : long
    {
        攻击之爪10 = 14001,
        攻击之爪25 = 14002,
        攻击之爪40 = 14003,
        攻击之爪55 = 14004,
        攻击之爪70 = 14005,
        攻击之爪85 = 14006,
        攻击之爪100 = 14007,
    }

    public enum ConsumableID : long
    {
        小经验书 = 15001,
        中经验书 = 15002,
        大经验书 = 15003,
        小回复药 = 15004,
        中回复药 = 15005,
        大回复药 = 15006,
        魔力填充剂1 = 15007,
        魔力填充剂2 = 15008,
        魔力填充剂3 = 15009,
        能量饮料1 = 15010,
        能量饮料2 = 15011,
        能量饮料3 = 15012,
        复苏药1 = 15013,
        复苏药2 = 15014,
        复苏药3 = 15015,
        全回复药 = 15016
    }

    public enum SpecialItemID : long
    {
        升华之印 = 18001,
        流光之印 = 18002,
        永恒之印 = 18003,
        技能卷轴 = 18004,
        智慧之果 = 18005,
        奥术符文 = 18006,
        混沌之核 = 18007,
        奖券 = 18008,
        十连奖券 = 18009,
        改名卡 = 18010,
        原初之印 = 18011,
        创生之印 = 18012,
        法则精粹 = 18013,
        大师锻造券 = 18014,
        钻石 = 18998,
        探索许可 = 18999,
        青松 = 18921,
        流星石 = 18922,
        向日葵 = 18923,
        金铃花 = 18924,
        琉璃珠 = 18925,
        鸣草 = 18926,
        马尾 = 18927,
        鬼兜虫 = 18928,
        烈焰花花蕊 = 18929,
        堇瓜 = 18930,
        水晶球 = 18931,
        薰衣草 = 18932,
        青石 = 18933,
        莲花 = 18934,
        陶罐 = 18935,
        海灵芝 = 18936,
        四叶草 = 18937,
        露珠 = 18938,
        茉莉花 = 18939,
        绿萝 = 18940,
        檀木扇 = 18941,
        鸟蛋 = 18942,
        竹笋 = 18943,
        晶核 = 18944,
        手工围巾 = 18945,
        柳条篮 = 18946,
        风筝 = 18947,
        羽毛 = 18948,
        发光髓 = 18949,
        紫罗兰 = 18950,
        松果 = 18951,
        电气水晶 = 18952,
        薄荷 = 18953,
        竹节 = 18954,
        铁砧 = 18955,
        冰雾花 = 18956,
        海草 = 18957,
        磐石 = 18958,
        砂砾 = 18959,
        铁甲贝壳 = 18960,
        蜥蜴尾巴 = 18961,
        古老钟摆 = 18962,
        枯藤 = 18963
    }

    public enum GiftBoxID : long
    {
        年夜饭 = 20001,
        蛇年大吉 = 20002,
        新春快乐 = 20003,
        毕业礼包 = 20004,
        魔法卡礼包 = 20005,
        探索助力礼包 = 20006
    }
}
