namespace Oshima.FunGame.OshimaModules.Items
{
    public enum AccessoryID : long
    {
        攻击之爪10 = 14001,
        攻击之爪20 = 14002,
        攻击之爪30 = 14003,
        攻击之爪40 = 14004,
    }

    public enum ConsumableID : long
    {
        小经验书 = 15001,
        中经验书 = 15002,
        大经验书 = 15003,
        小回复药 = 15004,
        中回复药 = 15005,
        大回复药 = 15006,
        魔力填充剂1 = 15007,
        魔力填充剂2 = 15008,
        魔力填充剂3 = 15009,
        能量饮料1 = 15010,
        能量饮料2 = 15011,
        能量饮料3 = 15012,
        复苏药1 = 15013,
        复苏药2 = 15014,
        复苏药3 = 15015,
        全回复药 = 15016
    }

    public enum SpecialItemID : long
    {
        升华之印 = 18001,
        流光之印 = 18002,
        永恒之印 = 18003,
        技能卷轴 = 18004,
        智慧之果 = 18005,
        奥术符文 = 18006,
        混沌之核 = 18007,
    }

    public enum GiftBoxID : long
    {
        年夜饭 = 20001,
        蛇年大吉 = 20002,
        新春快乐 = 20003,
        毕业礼包 = 20004
    }
}
