namespace Oshima.FunGame.OshimaModules.Items
{
    public enum WeaponID : long
    {
        糖糖一周年纪念武器 = 11001,
        独奏弓 = 11002
    }

    public enum ArmorID : long
    {
        糖糖一周年纪念防具 = 12001
    }

    public enum ShoesID : long
    {
        糖糖一周年纪念鞋子 = 13001
    }

    public enum AccessoryID : long
    {
        攻击之爪10 = 14001,
        攻击之爪25 = 14002,
        攻击之爪40 = 14003,
        攻击之爪55 = 14004,
        攻击之爪70 = 14005,
        攻击之爪85 = 14006,
        攻击之爪100 = 14007,
        糖糖一周年纪念饰品1 = 14008,
        糖糖一周年纪念饰品2 = 14009
    }

    public enum ConsumableID : long
    {
        小经验书 = 15001,
        中经验书 = 15002,
        大经验书 = 15003,
        小回复药 = 15004,
        中回复药 = 15005,
        大回复药 = 15006,
        魔力填充剂1 = 15007,
        魔力填充剂2 = 15008,
        魔力填充剂3 = 15009,
        能量饮料1 = 15010,
        能量饮料2 = 15011,
        能量饮料3 = 15012,
        复苏药1 = 15013,
        复苏药2 = 15014,
        复苏药3 = 15015,
        全回复药 = 15016
    }

    public enum CollectibleID
    {
        青松 = 17001,
        流星石 = 17002,
        向日葵 = 17003,
        金铃花 = 17004,
        琉璃珠 = 17005,
        鸣草 = 17006,
        马尾 = 17007,
        鬼兜虫 = 17008,
        烈焰花花蕊 = 17009,
        堇瓜 = 17010,
        水晶球 = 17011,
        薰衣草 = 17012,
        青石 = 17013,
        莲花 = 17014,
        陶罐 = 17015,
        海灵芝 = 17016,
        四叶草 = 17017,
        露珠 = 17018,
        茉莉花 = 17019,
        绿萝 = 17020,
        檀木扇 = 17021,
        鸟蛋 = 17022,
        竹笋 = 17023,
        晶核 = 17024,
        手工围巾 = 17025,
        柳条篮 = 17026,
        风筝 = 17027,
        羽毛 = 17028,
        发光髓 = 17029,
        紫罗兰 = 17030,
        松果 = 17031,
        电气水晶 = 17032,
        薄荷 = 17033,
        竹节 = 17034,
        铁砧 = 17035,
        冰雾花 = 17036,
        海草 = 17037,
        磐石 = 17038,
        砂砾 = 17039,
        铁甲贝壳 = 17040,
        蜥蜴尾巴 = 17041,
        古老钟摆 = 17042,
        枯藤 = 17043
    }

    public enum SpecialItemID : long
    {
        升华之印 = 18001,
        流光之印 = 18002,
        永恒之印 = 18003,
        技能卷轴 = 18004,
        智慧之果 = 18005,
        奥术符文 = 18006,
        混沌之核 = 18007,
        奖券 = 18008,
        十连奖券 = 18009,
        改名卡 = 18010,
        原初之印 = 18011,
        创生之印 = 18012,
        法则精粹 = 18013,
        大师锻造券 = 18014,
        钻石 = 18998,
        探索许可 = 18999
    }

    public enum GiftBoxID : long
    {
        年夜饭 = 20001,
        蛇年大吉 = 20002,
        新春快乐 = 20003,
        毕业礼包 = 20004,
        魔法卡礼包 = 20005,
        探索助力礼包 = 20006,
        一周年纪念礼包 = 20007,
        一周年纪念套装 = 20008,
        冬至快乐 = 20009,
        圣诞礼包 = 20010,
        元旦快乐 = 20011,
        马年大吉 = 20012
    }
}
