namespace Oshima.FunGame.OshimaModules.Skills
{
    /**
     * 冰霜攻击 = 单体伤害
     * 火之矢 = 单体伤害
     * 水之矢 = 单体伤害 
     * 石之锤 = 单体伤害 
     * 风之轮 = 单体伤害 
     * 心灵之霞 = 单体伤害 
     * 次元上升 = 单体伤害+眩晕(时间型)
     * 暗物质 = 单体伤害
     * 
     * 回复术 = 我方·单体回复,
     * 治愈术 = 我方·单体回复,
     * 复苏术 = 我方·单体弱驱散+回复+复苏,
     * 圣灵术 = 我方·全体弱驱散+回复+复苏,
     * 时间加速 = 我方·单体速度提升(时间型),
     * 时间减速 = 单体速度减少(时间型),
     * 反魔法领域 = 多目标封技(技能受限，时间型)+施法解除，
     * 沉默十字 = 多目标封技(技能受限，回合型)+施法解除，
     * 虚弱领域 = 全体虚弱(伤害降低+护甲魔抗降低+重伤，时间型),
     * 混沌烙印 = 单体气绝(行动受限+持续伤害，时间型),
     * 凝胶稠絮 = 单体虚弱(伤害降低+护甲魔抗降低+重伤，回合型),
     * 
     * 大地之墙 = 我方·多目标护盾+持续性弱驱散(时间型),
     * 盖亚之盾 = 我方·全体物理+魔法护盾,
     * 风之守护 = 我方·暴击率+闪避提升(回合型),
     * 结晶防护 = 我方·护甲+魔抗提升(回合型),
     * 强音之力 = 我方·攻击提升(回合型),
     * 神圣祝福 = 我方·攻击+护甲+魔抗提升(回合型)
    */
    public enum MagicID : long
    {
        冰霜攻击 = 1001,
        火之矢 = 1002,
        水之矢 = 1003,
        石之锤 = 1004,
        风之轮 = 1005,
        心灵之霞 = 1006,
        次元上升 = 1007,
        暗物质 = 1008,

        回复术 = 1009,
        治愈术 = 1010,
        复苏术 = 1011,
        圣灵术 = 1012,
        时间加速 = 1013,
        时间减速 = 1014,
        反魔法领域 = 1015,
        沉默十字 = 1016,
        虚弱领域 = 1017,
        混沌烙印 = 1018,
        凝胶稠絮 = 1019,

        大地之墙 = 1020,
        盖亚之盾 = 1021,
        风之守护 = 1022,
        结晶防护 = 1023,
        强音之力 = 1024,
        神圣祝福 = 1025
    }

    public enum SkillID : long
    {
        疾风步 = 2001,
    }

    public enum SuperSkillID : long
    {
        力量爆发 = 3001,
        天赐之力 = 3002,
        魔法涌流 = 3003,
        三重叠加 = 3004,
        变幻之心 = 3005,
        精准打击 = 3006,
        绝对领域 = 3007,
        能量毁灭 = 3008,
        迅捷之势 = 3009,
        嗜血本能 = 3010,
        平衡强化 = 3011,
        血之狂欢 = 3012,
    }

    public enum PassiveID : long
    {
        META马 = 4001,
        心灵之火 = 4002,
        魔法震荡 = 4003,
        灵能反射 = 4004,
        智慧与力量 = 4005,
        致命打击 = 4006,
        毁灭之势 = 4007,
        枯竭打击 = 4008,
        破釜沉舟 = 4009,
        累积之压 = 4010,
        敏捷之刃 = 4011,
        弱者猎手 = 4012,
    }

    public enum ItemPassiveID : long
    {
        攻击之爪 = 5001,
    }

    public enum ItemActiveID : long
    {
        经验书 = 6001,
        回复药 = 6002,
        魔力填充剂 = 6003,
        能量饮料 = 6004,
        礼包 = 6005,
        复苏药 = 6006
    }
}
