namespace Oshima.FunGame.OshimaModules.Skills
{
    public enum MagicID : long
    {
        冰霜攻击 = 1001,
        火之矢 = 1002,
        水之矢 = 1003,
        石之锤 = 1004,
        风之轮 = 1005,
        心灵之霞 = 1006,
        次元上升 = 1007,
        暗物质 = 1008,

        回复术 = 1009,
        治愈术 = 1010,
        复苏术 = 1011,
        圣灵术 = 1012,
        时间加速 = 1013,
        时间减速 = 1014,
        反魔法领域 = 1015,
        沉默十字 = 1016,
        虚弱领域 = 1017,
        混沌烙印 = 1018,
        凝胶稠絮 = 1019,

        大地之墙 = 1020,
        盖亚之盾 = 1021,
        风之守护 = 1022,
        结晶防护 = 1023,
        强音之力 = 1024,
        神圣祝福 = 1025
    }

    public enum SkillID : long
    {
        疾风步 = 2001,
    }

    public enum SuperSkillID : long
    {
        力量爆发 = 3001,
        天赐之力 = 3002,
        魔法涌流 = 3003,
        三重叠加 = 3004,
        变幻之心 = 3005,
        精准打击 = 3006,
        绝对领域 = 3007,
        能量毁灭 = 3008,
        迅捷之势 = 3009,
        嗜血本能 = 3010,
        平衡强化 = 3011,
        血之狂欢 = 3012,
    }

    public enum PassiveID : long
    {
        META马 = 4001,
        心灵之火 = 4002,
        魔法震荡 = 4003,
        灵能反射 = 4004,
        智慧与力量 = 4005,
        致命打击 = 4006,
        毁灭之势 = 4007,
        枯竭打击 = 4008,
        玻璃大炮 = 4009,
        累积之压 = 4010,
        敏捷之刃 = 4011,
        弱者猎手 = 4012,
    }

    public enum ItemPassiveID : long
    {
        攻击之爪 = 5001,
    }

    public enum ItemActiveID : long
    {

    }
}
